Herimarque-soap-client/age_list_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:head="http://apache.org/headers" xmlns:ser="http://service.agecrlts.crlts.cha/">
   <soapenv:Header>
      <head:ComMsgHeader>
         <RequestMsgID>bkang721</RequestMsgID>
         <ServiceKey>r4kz8tI1CNlZ/CnyNqeS/qjFaWpwFfjbj+DlBFL7t5/aYDO5N63Ec748ICA0FQJ2dAzgWtY49qqNrgNF+dvubw==</ServiceKey>
      </head:ComMsgHeader>
   </soapenv:Header>
   <soapenv:Body>
      <ser:getAgeCrltsList>
         <arg0>
           <ageCd>code</ageCd>
           <pageMg>size</pageMg>
           <nowPageNo>pagenum</nowPageNo>
         </arg0>
      </ser:getAgeCrltsList>
   </soapenv:Body>
</soapenv:Envelope> 